[
  {
    "point_id": "4.1",
    "question_number": 1,
    "question": "State two differences between system software and application software. Give one example of each.",
    "mark_scheme": "Answer:\n(State: express in clear terms)\n- System software manages the computer hardware and provides a platform for other software; example: operating system.\n- Application software allows the user to perform specific tasks; example: spreadsheet."
  },
  {
    "point_id": "4.1",
    "question_number": 2,
    "question": "Describe two functions of an operating system.",
    "mark_scheme": "Answer:\n(Describe: state the points of a topic / give characteristics and main features)\n- Managing files: The operating system handles the creation, deletion, renaming, and organization of files and directories, allowing users to store and retrieve data efficiently.\n- Managing memory: The operating system allocates memory to applications, tracks which parts of memory are in use, and ensures isolation between processes to prevent conflicts."
  },
  {
    "point_id": "4.1",
    "question_number": 3,
    "question": "Define the term \"firmware\" and explain its role in running application software.",
    "mark_scheme": "Answer:\n(Define: give precise meaning)\nFirmware is software stored permanently on hardware, usually in ROM, that provides low-level control for devices and is executed when the computer starts to load the operating system.\n(Explain: set out purposes or reasons / make the relationships between things evident / provide why and/or how and support with relevant evidence)\nWhen a computer is started, the firmware is loaded by the bootstrap; the firmware then loads the operating system, which provides a platform to run application software."
  },
  {
    "point_id": "4.1",
    "question_number": 4,
    "question": "Explain how an interrupt is generated and how it is handled by the operating system.",
    "mark_scheme": "Answer:\n(Explain: set out purposes or reasons / make the relationships between things evident / provide why and/or how and support with relevant evidence)\nAn interrupt is generated by hardware (e.g., pressing a key) or software (e.g., division by zero). After finishing the current fetch-decode-execute cycle, the processor checks the interrupt queue, saves the current task’s state, executes the corresponding Interrupt Service Routine (ISR), then resumes the previous task."
  },
  {
    "point_id": "4.1",
    "question_number": 5,
    "question": "Give one example each of a hardware interrupt and a software interrupt.",
    "mark_scheme": "Answer:\n(Give: produce an answer from recall/memory)\n- Hardware interrupt: Pressing a key on the keyboard.\n- Software interrupt: Division by zero in a program."
  },
  {
    "point_id": "4.1",
    "question_number": 6,
    "question": "Outline the steps that occur when application software is run on a computer system.",
    "mark_scheme": "Answer:\n(Outline: set out main points)\n- The bootstrap program loads the firmware.\n- The firmware starts and loads the operating system.\n- The operating system provides the interface and environment to run application software."
  },
  {
    "point_id": "4.1",
    "question_number": 7,
    "question": "Describe the function of a device driver within system software.",
    "mark_scheme": "Answer:\n(Describe: state the points of a topic / give characteristics and main features)\nA device driver is system software that enables communication between the operating system and hardware peripherals (e.g., printer or mouse) by translating data and commands."
  },
  {
    "point_id": "4.1",
    "question_number": 8,
    "question": "State two examples of utility software and the main purpose of each.",
    "mark_scheme": "Answer:\n(State: express in clear terms)\n- Virus checker (antivirus): Detects and removes malware from the system.\n- Disk defragmenter: Rearranges fragmented files on disk to improve access speed."
  },
  {
    "point_id": "4.1",
    "question_number": 9,
    "question": "Explain the purpose of memory management in an operating system.",
    "mark_scheme": "Answer:\n(Explain: set out purposes or reasons / make the relationships between things evident / provide why and/or how and support with relevant evidence)\nMemory management allows the operating system to allocate memory to processes, prevent unauthorized memory access between programs, and ensure optimal use of RAM."
  },
  {
    "point_id": "4.1",
    "question_number": 10,
    "question": "Describe two main differences between a Graphical User Interface (GUI) and a Command Line Interface (CLI).",
    "mark_scheme": "Answer:\n(Describe: state the points of a topic / give characteristics and main features)\n- GUI uses icons and windows; CLI uses typed text commands.\n- GUI is more user-friendly but consumes more memory; CLI is efficient but requires command knowledge."
  },
  {
    "point_id": "4.1",
    "question_number": 11,
    "question": "State one advantage and one disadvantage of using a GUI.",
    "mark_scheme": "Answer:\n(State: express in clear terms)\n- Advantage: Easy to use, especially for beginners.\n- Disadvantage: Requires more system resources."
  },
  {
    "point_id": "4.1",
    "question_number": 12,
    "question": "State one advantage and one disadvantage of using a CLI.",
    "mark_scheme": "Answer:\n(State: express in clear terms)\n- Advantage: Efficient use of memory and faster for experienced users.\n- Disadvantage: Requires knowledge of command syntax."
  },
  {
    "point_id": "4.1",
    "question_number": 13,
    "question": "Identify three tasks performed by the file management function of an operating system.",
    "mark_scheme": "Answer:\n(Identify: name/select/recognise)\n- Creating and deleting files.\n- Renaming files and folders.\n- Organizing directory structures."
  },
  {
    "point_id": "4.1",
    "question_number": 14,
    "question": "Describe how buffers and interrupts work together when printing a document.",
    "mark_scheme": "Answer:\n(Describe: state the points of a topic / give characteristics and main features)\nWhen printing, data is sent to a buffer. The slower printer prints from the buffer. If more data is needed, the device sends an interrupt to the processor, which responds while continuing other tasks."
  },
  {
    "point_id": "4.1",
    "question_number": 15,
    "question": "State two reasons why operating systems need to manage user accounts.",
    "mark_scheme": "Answer:\n(State: express in clear terms)\n- To protect user-specific data and preferences.\n- To control access levels and maintain security."
  },
  {
    "point_id": "4.1",
    "question_number": 16,
    "question": "Give two reasons why multitasking is important in operating systems.",
    "mark_scheme": "Answer:\n(Give: produce an answer from recall/memory)\n- It enables multiple programs to run simultaneously.\n- It improves CPU efficiency by minimizing idle time."
  },
  {
    "point_id": "4.1",
    "question_number": 17,
    "question": "State what is meant by an interrupt.",
    "mark_scheme": "Answer:\n(State: express in clear terms)\nAn interrupt is a signal sent to the processor to indicate that an event needs immediate attention."
  },
  {
    "point_id": "4.1",
    "question_number": 18,
    "question": "Describe the role of an Interrupt Service Routine (ISR).",
    "mark_scheme": "Answer:\n(Describe: state the points of a topic / give characteristics and main features)\nAn ISR is a special program executed by the processor in response to an interrupt. It handles the event, then returns control to the interrupted task."
  }
]